app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `email`, `password`, `updated_at`, `username`) VALUES ('2011-09-20 09:03:04', 'prasad.gurjar@gmail.com', 'desert', '2011-09-20 09:03:04', 'prasad')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `email` = 'saurabh@yahoo.com', `updated_at` = '2011-09-20 10:50:47' WHERE `users`.`id` = 3
---
  def update
    p "****************"
    p params[:user]
    p "***************"
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])